       PROGRAM-ID. COBSAMPL AS "COBOLSAMPLE.COBSAMPL".

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           SELECT INFIL ASSIGN TO 'C:\TEMP\CUST.TXT'
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INFIL.
       01 CUSTIN PIC X(50).
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY 'COBOL SAMPLE'.
           GOBACK.

       END PROGRAM COBSAMPL.
